app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
	@user = current_user
	@comment = @post.comments.create!(
		:body => params[:comment][:body],
		:user => @user
	)
---
SELECT * FROM "posts" WHERE ("posts"."id" = 7)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "user_id") VALUES('2012-02-08 22:46:31', 'test', '2012-02-08 22:46:31', 7, NULL)