app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts".user_id = 2)
---
	def index
		@posts = Post.all(:order => "created_at DESC")

SELECT * FROM "posts" WHERE ("posts"."id" = 7)
---
	def show
		@user = current_user
		@post = Post.find(params[:id])

INSERT INTO "posts" ("route", "created_at", "updated_at", "user_id", "message") VALUES(NULL, '2012-02-06 02:28:36', '2012-02-06 02:28:36', 1, 'My bus was late.')
---
	def create
		@user = current_user
		@post = Post.create(
			:message => params[:message],
			:route => params[:route],
			:user => @user
		)