app/controllers/votes_controller.rb

  def create
    @post = Post.find(params[:post_id])
	@user = current_user
	@vote = @post.votes.create!(
		:user => @user
	)
---
SELECT * FROM "posts" WHERE ("posts"."id" = 10)
INSERT INTO "votes" ("created_at", "updated_at", "post_id", "user_id") VALUES('2012-02-09 00:35:24', '2012-02-09 00:35:24', 10, 1)